{"config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_1", "filters": 32, "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "dtype": "float32", "trainable": true, "use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "name": "conv2d_2", "filters": 64, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.4}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "activation": "softmax"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8"}